##### TRANSMIT SIDE (INTERNAL CLOCK SHIFTED BY 90)
#---------------------------------------------------------------------------------

# Create a 125MHz clock and apply generated clocks to the PLL outputs
# pll|clk[0]: clock for TXD registers
# pll|clk[1]: TX_CLK with 90 degree phase shift--this delay is design-dependent
create_clock -name input_clock -period 8 [get_ports clk_125]
# Below are the pll derived clocks, which can also be generated by typing
# derive_pll_clocks in the TCL console
# You can refer to The Quartus II TimeQuest Timing Analyzer chapter in Quartus II handbook
create_generated_clock -name pll_62_5m_clk -source [get_pins \
{altpll_125_inst|altpll_component|pll|inclk[0]}] [get_pins \
{altpll_125_inst|altpll_component|pll|clk[0]}]
create_generated_clock -name mac_tx_clk_45_shift -phase 90 -source [get_pins \
{altpll_125_inst|altpll_component|pll|inclk[0]}] [get_pins \
{altpll_125_inst|altpll_component|pll|clk[1]}]
# Apply a generated clock to the clk_out port
#create_generated_clock -name tx_output_clock -source [get_ports clk_125] \
[get_ports {rgmii_tx_clk}]
# Set output delay based on the requirements mentioned previously
set_output_delay -clock mac_tx_clk_45_shift -max 1.0 [get_ports rgmii_txd*]
set_output_delay -clock mac_tx_clk_45_shift -min -0.8 [get_ports rgmii_txd*] -add_delay
set_output_delay -clock mac_tx_clk_45_shift -clock_fall -max 1.0 [get_ports rgmii_txd*] -add_delay
set_output_delay -clock mac_tx_clk_45_shift -clock_fall -min -0.8 [get_ports rgmii_txd*] \
-add_delay
set_output_delay -clock mac_tx_clk_45_shift -max 1.0 [get_ports {rgmii_tx_ctl}]
set_output_delay -clock mac_tx_clk_45_shift -min -0.8 [get_ports {rgmii_tx_ctl}] -add_delay
set_output_delay -clock mac_tx_clk_45_shift -clock_fall -max 1.0 [get_ports {rgmii_tx_ctl}]
set_output_delay -clock mac_tx_clk_45_shift -clock_fall -min -0.8 [get_ports {rgmii_tx_ctl}]
# Set false paths to remove irrelevant setup and hold analysis
#set_false_path -fall_from [get_clocks mac_tx_clk_45_shift] -rise_to [get_clocks \
tx_output_clock] -setup
#set_false_path -rise_from [get_clocks mac_tx_clk_45_shift] -fall_to [get_clocks \
tx_output_clock] -setup
#set_false_path -fall_from [get_clocks mac_tx_clk_45_shift] -fall_to [get_clocks \
tx_output_clock] -hold
#set_false_path -rise_from [get_clocks mac_tx_clk_45_shift] -rise_to [get_clocks \
tx_output_clock] hold