


#------------------------------------------------------------------------------------------#
#---------------------------------------RECEIVE SIDE---------------------------------------#
#------------------------------------------------------------------------------------------#
# Create a 125MHz clock
# virtual_source: an ideal clock in the sourcing device
# RX_CLK: input clock port of the interface; 90 deg phase shifted
create_clock -name virtual_source -period 8
create_clock -name rgmii_rx_clk -period 8 -waveform { 2 6 } [get_ports {rgmii_rx_clk}]
# Set input delay based on the requirements mentioned previously
# RX_CLK is 90 deg phase shifted
# Input delay is relative to the rising and falling edges of the clock
set_input_delay -max 0.8 -clock [get_clocks virtual_source] -add_delay [get_ports rgmii_rxd*]
set_input_delay -min -0.8 -clock [get_clocks virtual_source] -add_delay [get_ports rgmii_rxd*]
set_input_delay -max 0.8 -clock_fall -clock [get_clocks virtual_source] -add_delay [get_ports rgmii_rxd*]
set_input_delay -min -0.8 -clock_fall -clock [get_clocks virtual_source] -add_delay [get_ports rgmii_rxd*]

set_input_delay -max 0.8 -clock [get_clocks virtual_source] -add_delay [get_ports {rgmii_rx_ctl}]
set_input_delay -min -0.8 -clock [get_clocks virtual_source] -add_delay [get_ports {rgmii_rx_ctl}]
set_input_delay -max 0.8 -clock_fall -clock [get_clocks virtual_source] -add_delay [get_ports {rgmii_rx_ctl}]
set_input_delay -min -0.8 -clock_fall -clock [get_clocks virtual_source] -add_delay [get_ports {rgmii_rx_ctl}]

# Set false paths to remove irrelevant setup and hold analysis
set_false_path -fall_from [get_clocks virtual_source] -rise_to [get_clocks {rgmii_rx_clk}] -setup
set_false_path -rise_from [get_clocks virtual_source] -fall_to [get_clocks {rgmii_rx_clk}] -setup
set_false_path -fall_from [get_clocks virtual_source] -fall_to [get_clocks {rgmii_rx_clk}] -hold
set_false_path -rise_from [get_clocks virtual_source] -rise_to [get_clocks {rgmii_rx_clk}] -hold


#------------------------------------------------------------------------------------------#
#---------------------------------------TRANSMIT SIDE--------------------------------------#
#------------------------------------------------------------------------------------------#
# Create a 125MHz clock and apply generated clocks to the PLL outputs
# pll|clk[0]: clock for TXD registers
# pll|clk[1]: TX_CLK with 90 degree phase shift--this delay is design-dependent
create_clock -name input_clock -period 8 [get_ports clk_125]
# Below are the pll derived clocks, which can also be generated by typing
# derive_pll_clocks in the TCL console
# You can refer to The Quartus II TimeQuest Timing Analyzer chapter in Quartus II handbook
create_generated_clock -name tx_data_clock -source [get_pins {altpll_125|altpll_component|pll|inclk[0]}] [get_pins {tx_pll|altpll_component|pll|clk[1]}]

#create_generated_clock -name pll_output -phase 90 -source [get_pins {tx_pll|altpll_component|pll|inclk[0]}] [get_pins {tx_pll|altpll_component|pll|clk[1]}]

# Apply a generated clock to the clk_out port
create_generated_clock -name tx_output_clock -source [get_ports clk_125] [get_ports {rgmii_tx_clk}]

# Set output delay based on the requirements mentioned previously
set_output_delay -clock tx_output_clock -max 1.0 [get_ports rgmii_txd*]
set_output_delay -clock tx_output_clock -min -0.8 [get_ports rgmii_txd*] -add_delay
set_output_delay -clock tx_output_clock -clock_fall -max 1.0 [get_ports rgmii_txd*] -add_delay
set_output_delay -clock tx_output_clock -clock_fall -min -0.8 [get_ports rgmii_txd*] -add_delay
set_output_delay -clock tx_output_clock -max 1.0 [get_ports {rgmii_tx_ctl}]
set_output_delay -clock tx_output_clock -min -0.8 [get_ports {rgmii_tx_ctl}] -add_delay
set_output_delay -clock tx_output_clock -clock_fall -max 1.0 [get_ports {rgmii_tx_ctl}]
set_output_delay -clock tx_output_clock -clock_fall -min -0.8 [get_ports {rgmii_tx_ctl}]

# Set false paths to remove irrelevant setup and hold analysis
set_false_path -fall_from [get_clocks tx_data_clock] -rise_to [get_clocks tx_output_clock] -setup
set_false_path -rise_from [get_clocks tx_data_clock] -fall_to [get_clocks tx_output_clock] -setup
set_false_path -fall_from [get_clocks tx_data_clock] -fall_to [get_clocks tx_output_clock] -hold
set_false_path -rise_from [get_clocks tx_data_clock] -rise_to [get_clocks tx_output_clock] -hold